//2. Логічні розгалуження:

//- Є змінна х, якій ви надаєте довільне числове значення.
// Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a,що дорівнює 1, 0, -3

let x= 8;

if(x !== 0){
    console.log('Вірно');
}else {
    console.log('Невірно');
}

console.log('------------------------------------------------------------')

//- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години
// попадає число(в першу, другу, третю или четверту частину години).

let time = 55;

if(time >= 0 && time < 60){

if(time < 15){
    console.log('Перша чверть')
}

if(time >=15 && time < 30){
    console.log('Друга чверть')
}

if(time >=30 && time < 45){
    console.log('Третя чверть')
}
if(time >=45){
    console.log('Четверта чверть')
}
}else(console.log('Неправильно введений час!'))

console.log('------------------------------------------------------------')


//- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число
// (у першу, другу чи третю).

let day = 14;

if(day >= 1 && day <= 31){

    if(day < 11){
        console.log('Перша декада')
    }

    if(day >=11 && day < 21){
        console.log('Друга декада')
    }

    if(day >=21){
        console.log('Третя декада')
    }

}else(console.log('Неправильно введений день!'))

console.log('------------------------------------------------------------')

//- Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані
// відображається інфа що заплановано на цей день (можна замість плану на день, назву дня англійською).

let weekday = 2;

switch (weekday) {
    case 1:
        console.log('Monday');

        break;
    case 2:
        console.log('Tuesday');
        break;
    case 3:
        console.log('Wednesday');

        break;
    case 4:
        console.log('Thursday');
        break;
    case 5:
        console.log('Friday');

        break;
    case 6:
        console.log('Saturday');
        break;
    case 7:
        console.log('Sunday');

        break;
    default:
        console.log('Неправильно введений номер дня тижня!');
}

console.log('------------------------------------------------------------')


//- Користувач вводить або має два числа.
//Потрібно знайти та вивести максимальне число з тих двох .
//Також потрібно врахувати коли введені рівні числа.

let a= 11;
let b= 9;

if(a>b){
    console.log(`Максимальне значення : a = ${a} `)
}
if(a<b){
    console.log(`Максимальне значення : b = ${b} `)
}
if(a===b){
    console.log(`Значення рівні: a = b = ${a} `)
}


